nxp-mcuxpresso/mcux-sdk/components/power_manager/devices/MCXN947/fsl_pm_device.h
/* Power down */
#define PM_MASK_RESC_LOWEST_PDPD0 \
    ((1 << kResc_DCDC_CORE) | (1 << kResc_LDO_CORE) | PM_MASK_RESC_RAMS | PM_MASK_RESC_LOWEST_DPD0)
#define PM_MASK_RESC_LOWEST_PDPD1                                                               \
    ((1 << (kResc_USB3V_DET - 32)) | (1 << (kResc_BG_CORE - 32)) | (1 << (kResc_GDET - 32)) |   \
     (1 << (kResc_HVD_CORE - 32)) | (1 << (kResc_LVD_CORE - 32)) | (1 << (kResc_HVD_IO - 32)) | \
     (1 << (kResc_LVD_IO - 32)) | (1 << (kResc_IO_Det - 32)) | PM_MASK_RESC_LOWEST_DPD1)

/* Power down and deep sleep */
#define PM_MASK_RESC_LOWEST_PDDS0 ((1 << kResc_CORE_WAKE) | PM_MASK_RESC_LOWEST_PDPD0)
#define PM_MASK_RESC_LOWEST_PDDS1 ((1 << (kResc_FRO_12M - 32)) | (1 << (kResc_CMP2 - 32)) | PM_MASK_RESC_LOWEST_PDPD1)

/* Deep sleep */
#define PM_MASK_RESC_LOWEST_DEEP_SLEEP0 ((1 << kResc_Flash) | PM_MASK_RESC_LOWEST_PDDS0)
#define PM_MASK_RESC_LOWEST_DEEP_SLEEP1                                                                              \
    ((1 << (kResc_DAC0 - 32)) | (1 << (kResc_DAC1 - 32)) | (1 << (kResc_DAC2 - 32)) | (1 << (kResc_OPAMP0 - 32)) |   \
     (1 << (kResc_OPAMP1 - 32)) | (1 << (kResc_OPAMP2 - 32)) | (1 << (kResc_VREF - 32)) | (1 << (kResc_SINC - 32)) | \
     PM_MASK_RESC_LOWEST_PDDS1)

/* Sleep */
#define PM_MASK_RESC_LOWEST_SLEEP0 ((1 << kResc_FRO_144M) | PM_MASK_RESC_LOWEST_DEEP_SLEEP0)
#define PM_MASK_RESC_LOWEST_SLEEP1                                                                                 \
    ((1 << (kResc_PLL0 - 32)) | (1 << (kResc_PLL1 - 32)) | (1 << (kResc_OSC_SYS - 32)) | (1 << (kResc_ADC - 32)) | \
     PM_MASK_RESC_LOWEST_DEEP_SLEEP1)

/* Resource constraints that are not variable, set by the power mode*/
#define PM_MASK_RESC_NOT_VAR0 ~((1 << kResc_BUS_SYS_Clk) & (1 << kResc_CORE_WAKE))
#define PM_MASK_RESC_NOT_VAR1 (0xFFFFFFFFU)

/* Constraints used by application. */
/*!
 * @brief Set the constraint that BUS and SYSTEM clock should be ON.
 */
#define PM_RESC_BUS_SYS_CLK_ON PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_BUS_SYS_Clk)
/*!
 * @brief Constraint only applies in Power Down mode.  Configures if CORE_WAKE
          domain should be in Deep Sleep, or can go into Power Down mode.
 */
#define PM_RESC_CORE_WAKE_DEEP_SLEEP PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_CORE_WAKE)

/*!
 * @brief Set RAMAs in active, retain, power-off mode.
 */
#define PM_RESC_RAMA0_8K_ACTIVE    PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_SRAM_RAMA0_8K)
#define PM_RESC_RAMA0_8K_RETENTION PM_ENCODE_RESC(PM_RESOURCE_PARTABLE_ON1, kResc_SRAM_RAMA0_8K)
#define PM_RESC_RAMA0_8K_POWEROFF  PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_SRAM_RAMA0_8K)

#define PM_RESC_RAMA1_8K_ACTIVE    PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_SRAM_RAMA1_8K)
#define PM_RESC_RAMA1_8K_RETENTION PM_ENCODE_RESC(PM_RESOURCE_PARTABLE_ON1, kResc_SRAM_RAMA1_8K)
#define PM_RESC_RAMA1_8K_POWEROFF  PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_SRAM_RAMA1_8K)

#define PM_RESC_RAMA2_8K_ACTIVE    PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_SRAM_RAMA2_8K)
#define PM_RESC_RAMA2_8K_RETENTION PM_ENCODE_RESC(PM_RESOURCE_PARTABLE_ON1, kResc_SRAM_RAMA2_8K)
#define PM_RESC_RAMA2_8K_POWEROFF  PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_SRAM_RAMA2_8K)

#define PM_RESC_RAMA3_8K_ACTIVE    PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_SRAM_RAMA3_8K)
#define PM_RESC_RAMA3_8K_RETENTION PM_ENCODE_RESC(PM_RESOURCE_PARTABLE_ON1, kResc_SRAM_RAMA3_8K)
#define PM_RESC_RAMA3_8K_POWEROFF  PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_SRAM_RAMA3_8K)

/*!
 * @brief Set system SRAMs in active, retain, power-off mode.
 */
#define PM_RESC_RAMX0_32K_ACTIVE   PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_SRAM_RAMX0_32K)
#define PM_RESC_RAMX0_32K_RETAINED PM_ENCODE_RESC(PM_RESOURCE_PARTABLE_ON1, kResc_SRAM_RAMX0_32K)
#define PM_RESC_RAMX0_32K_POWEROFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_SRAM_RAMX0_32K)

#define PM_RESC_RAMX1_32K_ACTIVE   PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_SRAM_RAMX1_32K)
#define PM_RESC_RAMX1_32K_RETAINED PM_ENCODE_RESC(PM_RESOURCE_PARTABLE_ON1, kResc_SRAM_RAMX1_32K)
#define PM_RESC_RAMX1_32K_POWEROFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_SRAM_RAMX1_32K)

#define PM_RESC_RAMX2_32K_ACTIVE   PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_SRAM_RAMX2_32K)
#define PM_RESC_RAMX2_32K_RETAINED PM_ENCODE_RESC(PM_RESOURCE_PARTABLE_ON1, kResc_SRAM_RAMX2_32K)
#define PM_RESC_RAMX2_32K_POWEROFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_SRAM_RAMX2_32K)

#define PM_RESC_RAMB0_32K_ACTIVE   PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_SRAM_RAMB0_32K)
#define PM_RESC_RAMB0_32K_RETAINED PM_ENCODE_RESC(PM_RESOURCE_PARTABLE_ON1, kResc_SRAM_RAMB0_32K)
#define PM_RESC_RAMB0_32K_POWEROFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_SRAM_RAMB0_32K)

#define PM_RESC_RAMC0_32K_ACTIVE   PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_SRAM_RAMC0_32K)
#define PM_RESC_RAMC0_32K_RETAINED PM_ENCODE_RESC(PM_RESOURCE_PARTABLE_ON1, kResc_SRAM_RAMC0_32K)
#define PM_RESC_RAMC0_32K_POWEROFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_SRAM_RAMC0_32K)

#define PM_RESC_RAMC1_32K_ACTIVE   PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_SRAM_RAMC1_32K)
#define PM_RESC_RAMC1_32K_RETAINED PM_ENCODE_RESC(PM_RESOURCE_PARTABLE_ON1, kResc_SRAM_RAMC1_32K)
#define PM_RESC_RAMC1_32K_POWEROFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_SRAM_RAMC1_32K)

#define PM_RESC_RAMD0_32K_ACTIVE   PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_SRAM_RAMD0_32K)
#define PM_RESC_RAMD0_32K_RETAINED PM_ENCODE_RESC(PM_RESOURCE_PARTABLE_ON1, kResc_SRAM_RAMD0_32K)
#define PM_RESC_RAMD0_32K_POWEROFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_SRAM_RAMD0_32K)

#define PM_RESC_RAMD1_32K_ACTIVE   PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_SRAM_RAMD1_32K)
#define PM_RESC_RAMD1_32K_RETAINED PM_ENCODE_RESC(PM_RESOURCE_PARTABLE_ON1, kResc_SRAM_RAMD1_32K)
#define PM_RESC_RAMD1_32K_POWEROFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_SRAM_RAMD1_32K)

#define PM_RESC_RAME0_32K_ACTIVE   PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_SRAM_RAME0_32K)
#define PM_RESC_RAME0_32K_RETAINED PM_ENCODE_RESC(PM_RESOURCE_PARTABLE_ON1, kResc_SRAM_RAME0_32K)
#define PM_RESC_RAME0_32K_POWEROFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_SRAM_RAME0_32K)

#define PM_RESC_RAME1_32K_ACTIVE   PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_SRAM_RAME1_32K)
#define PM_RESC_RAME1_32K_RETAINED PM_ENCODE_RESC(PM_RESOURCE_PARTABLE_ON1, kResc_SRAM_RAME1_32K)
#define PM_RESC_RAME1_32K_POWEROFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_SRAM_RAME1_32K)

#define PM_RESC_RAMF0_32K_ACTIVE   PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_SRAM_RAMF0_32K)
#define PM_RESC_RAMF0_32K_RETAINED PM_ENCODE_RESC(PM_RESOURCE_PARTABLE_ON1, kResc_SRAM_RAMF0_32K)
#define PM_RESC_RAMF0_32K_POWEROFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_SRAM_RAMF0_32K)

