nxp-mcuxpresso/mcux-sdk/components/power_manager/devices/MCXN947/fsl_pm_device.h
#define PM_RESC_BG_VBAT_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_BG_VBAT)
#define PM_RESC_BG_VBAT_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_BG_VBAT)

#define PM_RESC_GDET_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_GDET)
#define PM_RESC_GDET_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_GDET)

/* vdd_core, vdd_sys, and vdd_io low-, high-voltage detect */
#define PM_RESC_HVD_CORE_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_HVD_CORE)
#define PM_RESC_HVD_CORE_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_HVD_CORE)
#define PM_RESC_HVD_SYS_ON   PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_HVD_SYS)
#define PM_RESC_HVD_SYS_OFF  PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_HVD_SYS)
#define PM_RESC_HVD_IO_ON    PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_HVD_IO)
#define PM_RESC_HVD_IO_OFF   PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_HVD_IO)

#define PM_RESC_LVD_CORE_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_LVD_CORE)
#define PM_RESC_LVD_CORE_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_LVD_CORE)
#define PM_RESC_LVD_SYS_ON   PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_LVD_SYS)
#define PM_RESC_LVD_SYS_OFF  PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_LVD_SYS)
#define PM_RESC_LVD_IO_ON    PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_LVD_IO)
#define PM_RESC_LVD_IO_OFF   PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_LVD_IO)

#define PM_RESC_IO_DET_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_IO_Det)
#define PM_RESC_IO_DET_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_IO_Det)
/*! @} */

#if FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER

/*!
 * @name Wakeup enumerations
 * @{
 */

typedef enum _wakeup_inputType
{
    kWup_inputType_extPin = 0U, /*!< External Pin type */
    kWup_inputType_intMod,      /*!< Internal Module type */
} wakeup_inputType_t;

typedef enum _wakeup_pin_det
{
    kWup_pinDet_RisingEdge = 1U, /*!< Rising  Edge detection */
    kWup_pinDet_FallingEdge,     /*!< Falling Edge detection */
    kWup_pinDet_AnyChange,       /*!< Any Change   detection */
} wakeup_pin_det_t;

typedef enum _wakeup_pinID
{
    kWup_pinID_P0_4  = 0U,  /*!< Port0 Pin4 */
    kWup_pinID_P0_7  = 1U,  /*!< Port0 Pin7 */
    kWup_pinID_P0_16 = 2U,  /*!< Port0 Pin16 */
    kWup_pinID_P0_19 = 3U,  /*!< Port0 Pin19 */
    kWup_pinID_P0_20 = 4U,  /*!< Port0 Pin20 */
    kWup_pinID_P0_23 = 5U,  /*!< Port0 Pin23 */
    kWup_pinID_P1_0  = 6U,  /*!< Port1 Pin0 */
    kWup_pinID_P1_3  = 7U,  /*!< Port1 Pin3 */
    kWup_pinID_P1_4  = 8U,  /*!< Port1 Pin4 */
    kWup_pinID_P1_7  = 9U,  /*!< Port1 Pin7 */
    kWup_pinID_P1_8  = 10U, /*!< Port1 Pin8 */
    kWup_pinID_P1_11 = 11U, /*!< Port1 Pin11 */
    kWup_pinID_P1_12 = 12U, /*!< Port1 Pin12 */
    kWup_pinID_P1_15 = 13U, /*!< Port1 Pin15 */
    kWup_pinID_P1_16 = 14U, /*!< Port1 Pin16 */
    kWup_pinID_P1_19 = 15U, /*!< Port2 Pin19 */
    kWup_pinID_P2_2  = 16U, /*!< Port2 Pin2 */
    kWup_pinID_P2_4  = 17U, /*!< Port2 Pin4 */
    kWup_pinID_P4_0  = 18U, /*!< Port4 Pin0 */
    kWup_pinID_P4_3  = 19U, /*!< Port4 Pin3 */
    kWup_pinID_P4_12 = 20U, /*!< Port4 Pin12 */
    kWup_pinID_P4_15 = 21U, /*!< Port4 Pin15 */
    kWup_pinID_P3_0  = 22U, /*!< Port3 Pin0 */
    kWup_pinID_P3_8  = 23U, /*!< Port3 Pin8 */
    kWup_pinID_P3_11 = 24U, /*!< Port3 Pin11 */
    kWup_pinID_P3_14 = 25U, /*!< Port3 Pin14 */
    kWup_pinID_P3_17 = 26U, /*!< Port3 Pin17 */
    kWup_pinID_P3_20 = 27U, /*!< Port3 Pin20 */
} wakeup_pinID_t;

typedef enum _wakeup_modID
{
    kWup_modID_SPC0 = 0U, /*!< SPC */
    kWup_modID_VBAT = 1U, /*!< VBAT */
    kWup_modID_RTC  = 2U, /*!< RTC */
    // kWup_modID_TDET = 3U,       /*!< TDET */
    kWup_modID_GPIO5_INT0 = 4U, /*!< GPIO5 interrupt 0 */
    kWup_modID_GPIO5_INT1 = 5U, /*!< GPIO5 interrupt 1 */
    kWup_modID_LPTMR0     = 6U, /*!< LPTMR0 */
    kWup_modID_LPTMR1     = 7U, /*!< LPTMR1 */
    kWup_modID_CMP0       = 8U, /*!< CMP0 */
    kWup_modID_CMP1       = 9U, /*!< CMP1 */
} wakeup_modID_t;

/*! @} */

/*!
 * @name System Wakeup source definitions.
 * @{
 */

/*!
 * @brief Enable external pin as the wakeup source, detect on rising edge/falling edge/any edge.
 */
#define PM_WSID_P0_4_RISING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P0_4, PORT_EFT_IRQn, kWup_pinDet_RisingEdge)
#define PM_WSID_P0_4_FALLING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P0_4, PORT_EFT_IRQn, kWup_pinDet_FallingEdge)
#define PM_WSID_P0_4_ANY_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P0_4, PORT_EFT_IRQn, kWup_pinDet_AnyChange)

#define PM_WSID_P0_7_RISING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P0_7, PORT_EFT_IRQn, kWup_pinDet_RisingEdge)
#define PM_WSID_P0_7_FALLING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P0_7, PORT_EFT_IRQn, kWup_pinDet_FallingEdge)
#define PM_WSID_P0_7_ANY_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P0_7, PORT_EFT_IRQn, kWup_pinDet_AnyChange)

#define PM_WSID_P0_16_RISING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P0_16, PORT_EFT_IRQn, kWup_pinDet_RisingEdge)
#define PM_WSID_P0_16_FALLING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P0_16, PORT_EFT_IRQn, kWup_pinDet_FallingEdge)
#define PM_WSID_P0_16_ANY_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P0_16, PORT_EFT_IRQn, kWup_pinDet_AnyChange)

#define PM_WSID_P0_19_RISING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P0_19, PORT_EFT_IRQn, kWup_pinDet_RisingEdge)
#define PM_WSID_P0_19_FALLING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P0_19, PORT_EFT_IRQn, kWup_pinDet_FallingEdge)
#define PM_WSID_P0_19_ANY_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P0_19, PORT_EFT_IRQn, kWup_pinDet_AnyChange)

#define PM_WSID_P0_20_RISING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P0_20, PORT_EFT_IRQn, kWup_pinDet_RisingEdge)
#define PM_WSID_P0_20_FALLING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P0_20, PORT_EFT_IRQn, kWup_pinDet_FallingEdge)
#define PM_WSID_P0_20_ANY_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P0_20, PORT_EFT_IRQn, kWup_pinDet_AnyChange)

#define PM_WSID_P0_23_RISING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P1_0, PORT_EFT_IRQn, kWup_pinDet_RisingEdge)
#define PM_WSID_P0_23_FALLING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P1_0, PORT_EFT_IRQn, kWup_pinDet_FallingEdge)
#define PM_WSID_P0_23_ANY_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P1_0, PORT_EFT_IRQn, kWup_pinDet_AnyChange)

#define PM_WSID_P1_0_RISING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P1_3, PORT_EFT_IRQn, kWup_pinDet_RisingEdge)
#define PM_WSID_P1_0_FALLING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P1_3, PORT_EFT_IRQn, kWup_pinDet_FallingEdge)
#define PM_WSID_P1_0_ANY_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P1_3, PORT_EFT_IRQn, kWup_pinDet_AnyChange)

#define PM_WSID_P1_3_RISING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P1_4, PORT_EFT_IRQn, kWup_pinDet_RisingEdge)
#define PM_WSID_P1_3_FALLING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P1_4, PORT_EFT_IRQn, kWup_pinDet_FallingEdge)
#define PM_WSID_P1_3_ANY_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P1_4, PORT_EFT_IRQn, kWup_pinDet_AnyChange)

#define PM_WSID_P1_4_RISING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P1_7, PORT_EFT_IRQn, kWup_pinDet_RisingEdge)
#define PM_WSID_P1_4_FALLING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P1_7, PORT_EFT_IRQn, kWup_pinDet_FallingEdge)
#define PM_WSID_P1_4_ANY_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P1_7, PORT_EFT_IRQn, kWup_pinDet_AnyChange)

