nxp-mcuxpresso/mcux-sdk/components/power_manager/devices/MCXN947/fsl_pm_device.h
#define PM_WSID_P3_11_RISING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P3_11, PORT_EFT_IRQn, kWup_pinDet_RisingEdge)
#define PM_WSID_P3_11_FALLING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P3_11, PORT_EFT_IRQn, kWup_pinDet_FallingEdge)
#define PM_WSID_P3_11_ANY_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P3_11, PORT_EFT_IRQn, kWup_pinDet_AnyChange)

#define PM_WSID_P3_14_RISING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P3_14, PORT_EFT_IRQn, kWup_pinDet_RisingEdge)
#define PM_WSID_P3_14_FALLING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P3_14, PORT_EFT_IRQn, kWup_pinDet_FallingEdge)
#define PM_WSID_P3_14_ANY_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P3_14, PORT_EFT_IRQn, kWup_pinDet_AnyChange)

#define PM_WSID_P3_17_RISING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P3_17, PORT_EFT_IRQn, kWup_pinDet_RisingEdge)
#define PM_WSID_P3_17_FALLING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P3_17, PORT_EFT_IRQn, kWup_pinDet_FallingEdge)
#define PM_WSID_P3_17_ANY_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P3_17, PORT_EFT_IRQn, kWup_pinDet_AnyChange)

#define PM_WSID_P3_20_RISING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P3_20, PORT_EFT_IRQn, kWup_pinDet_RisingEdge)
#define PM_WSID_P3_20_FALLING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P3_20, PORT_EFT_IRQn, kWup_pinDet_FallingEdge)
#define PM_WSID_P3_20_ANY_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P3_20, PORT_EFT_IRQn, kWup_pinDet_AnyChange)

/*!
 * @brief Enable on-chip module as the wakeup source.
 */
#define PM_WSID_SPC  PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_intMod, kWup_modID_SPC0, SPC_IRQn, 0UL)
#define PM_WSID_VBAT PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_intMod, kWup_modID_VBAT, VBAT0_IRQn, 0UL)
#define PM_WSID_RTC  PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_intMod, kWup_modID_RTC, RTC_IRQn, 0UL)
// #define PM_WSID_TDET            PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_intMod, kWup_modID_TDET, xxx, 0UL)
#define PM_WSID_GPIO5_INT0 PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_intMod, kWup_modID_GPIO5_INT0, GPIO50_IRQn, 0UL)
#define PM_WSID_GPIO5_INT1 PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_intMod, kWup_modID_GPIO5_INT1, GPIO51_IRQn, 0UL)
#define PM_WSID_LPTMR0     PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_intMod, kWup_modID_LPTMR0, LPTMR0_IRQn, 0UL)
#define PM_WSID_LPTMR1     PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_intMod, kWup_modID_LPTMR1, LPTMR1_IRQn, 0UL)
#define PM_WSID_CMP0       PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_intMod, kWup_modID_CMP0, HSCMP0_IRQn, 0UL)
#define PM_WSID_CMP1       PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_intMod, kWup_modID_CMP1, HSCMP1_IRQn, 0UL)

/*! @} */

#endif /* FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER */

/*******************************************************************************
 * APIs
 ******************************************************************************/

#endif /* _FSL_PM_DEVICE_H_ */
